In [1]:
import pandas as pd
ufo=pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [2]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [3]:
ufo.rename(columns={'City':'new city', 'Colors Reported':'new report', 'Shape Reported':'new shape', 'State':'new state', 'Time':'new time'},inplace=True)
ufo.head()
#rename,inline

               new city new report new shape new state         new time
0                Ithaca        NaN  TRIANGLE        NY   6/1/1930 22:00
1           Willingboro        NaN     OTHER        NJ  6/30/1930 20:00
2               Holyoke        NaN      OVAL        CO  2/15/1931 14:00
3               Abilene        NaN      DISK        KS   6/1/1931 13:00
4  New York Worlds Fair        NaN     LIGHT        NY  4/18/1933 19:00

# another mathod

In [7]:
new_name=['city','report','shape tab','state','time']
ufo.columns=new_name
ufo.head()

                   city report shape tab state             time
0                Ithaca    NaN  TRIANGLE    NY   6/1/1930 22:00
1           Willingboro    NaN     OTHER    NJ  6/30/1930 20:00
2               Holyoke    NaN      OVAL    CO  2/15/1931 14:00
3               Abilene    NaN      DISK    KS   6/1/1931 13:00
4  New York Worlds Fair    NaN     LIGHT    NY  4/18/1933 19:00

In [8]:
ufo.columns

Index(['city', 'report', 'shape tab', 'state', 'time'], dtype='object')

# replace method

In [10]:
ufo.columns=ufo.columns.str.replace(' ','__')
ufo.columns

Index(['city', 'report', 'shape__tab', 'state', 'time'], dtype='object')

In [1]:
# remove columnm